this.goblin_city_destroyed_event <- this.inherit("scripts/events/event", {
	m = {},
	function create()
	{
		this.m.ID = "event.location.goblin_city_destroyed";
		this.m.Title = "战后";
		this.m.Cooldown = 999999.0 * this.World.getTime().SecondsPerDay;
		this.m.Screens.push({
			ID = "A",
			Text = "[img]gfx/ui/events/event_119.png[/img]{哥布林的先头部队已不复存在，你率众进入城市开始洗劫。年幼的哥布林们纷纷被击毙、被割去头皮或斩首。但还有更多的哥布林在你们周围像巢穴被毁的蚂蚁一样乱跑，每只哥布林都在头顶举着什么诸如人类头骨和财宝之类的东西。其中一只哥布林举着一杆燃烧的哥布林战旗狂奔着，还有另一只绿皮拿着一只狼的脑袋跳着舞。你手下的人搜索着一间间房子与棚屋，把里头的绿皮屁精和其他任何会喘气的东西尽数诛杀。\n\n 被哥布林们当作市中心的一座古老要塞被人类反过来以掠夺者的身份攻陷。你亲自走入大厅，看见一个脖子上挂着用人类股骨做成的项链的瞎眼哥布林在地上爬着。那绿皮瘦仔冲着你的方向扭动着，显然它已经察觉到了你的存在，而它脸上痛苦的表情表明了它肯定也已经知道了它手下子民们的末日。你把那绿皮开膛破肚，让它横尸在石头地板上。你手下的雇佣兵们带头冲进一间满是哥布林长老的会议室，带着一种杀红了眼的狂怒将它们屠戮殆尽。残臂断指漫天飞舞，鲜血如泉喷溅而出，在墙壁与桌子上创作出一幅地狱绘图。\n\n 你走到外面的城堡庭院里。在那里有一堆尸体，其中一些残缺不全，另外一些被射成筛子，还有一具尸体里被塞满了火炬，就好像他的胸腔是个火盆一样。走过那些尸体，你发现了狼骑士的畜栏。你们烧掉了关着狼的笼子，并且把那些畜生的训练师扔进火里为它们的坐骑陪葬。其中一只狼挣开了笼子，冲进了已经被火焰覆盖的城市。它从一栋房子跑到另一个房子，哭嚎着寻求解脱。你看着火焰迅速吞噬着茅屋和草棚。在你们自己也被大火烧得啥也不剩前，你命令战团退出市区，看着整座城市被烧成灰烬。把劫掠来的东西安置好，你们现在可以清点战利品了。}",
			Image = "",
			List = [],
			Characters = [],
			Options = [
				{
					Text = "谁在那？",
					function getResult( _event )
					{
						return "B";
					}

				}
			],
			function start( _event )
			{
			}

		});
		this.m.Screens.push({
			ID = "B",
			Text = "[img]gfx/ui/events/event_119.png[/img]{在你清点收获时，那个计划了整个哥布林屠杀计划的神秘人又出现了。你几乎无法分辨他的肤色，因为他整个人从头到脚都被哥布林的内脏和碎肉浸透了。他手里拿着几张头皮和一个袋子，袋子顶上露出一堆耳朵和鼻子，底下还滴着血。他点点头。%SPEECH_ON%不错，旅行者，不错。咱们干得漂亮。%SPEECH_OFF%你问他城里的火是不是他放的，他给出肯定的答案。%SPEECH_ON%哥布林的后备部队在迷宫一样的城墙和地道里乱窜。我关上了它们的逃生通道，把它们堵在两堵城墙之间，封死入口，堵死出口，然后见什么烧什么。那些家伙很快就死绝了。我注意到你们良好的表现了。战利品你们可以自己留着，那些东西对我没用。%SPEECH_OFF%他转身走开了。你对着他大叫，询问那莫得感情的战士，问他怎么样才肯加入你的战团，价钱随便他开。这次他转过了身。%SPEECH_ON%呵，呵呵，哈哈，哈哈哈！旅行者啊！这笑话让你讲的，诶呦。搞笑。真实。得劲。但我在杀光所有的哥布林之前是不会停下来的。%SPEECH_OFF%这理由很合理，人各有志。但你还是很好奇。你问他外界到底还有多少这样的城市。%SPEECH_ON%二十三个。啊，不好意思，你是问整体的数量吗？我到现在为止已经毁了二十三座城，但还存在着，嗯……二，三……我猜少说还得有四千个。一路顺风，旅行者。%SPEECH_OFF%这次他彻底离开了。你转头看向 %companyname%。这次他们的意见出奇的一致：他们宁愿自己从来没听过这些话。}",
			Image = "",
			List = [],
			Characters = [],
			Options = [
				{
					Text = "也不算特别多是吧，哈？",
					function getResult( _event )
					{
						return 0;
					}

				}
			],
			function start( _event )
			{
			}

		});
	}

	function onUpdateScore()
	{
	}

	function onPrepare()
	{
	}

	function onPrepareVariables( _vars )
	{
	}

	function onDetermineStartScreen()
	{
		return "A";
	}

	function onClear()
	{
	}

});

